app/controllers/registration_controller.rb

INSERT INTO "users" ("address", "appointment", "assist", "best_time", "campaign", "city", "created_at", "credit", "current_sign_in_at", "current_sign_in_ip", "electric", "email", "encrypted_password", "ip", "last_sign_in_at", "last_sign_in_ip", "lead", "length", "name", "phone", "proptype", "qualified", "remember_created_at", "reset_password_sent_at", "reset_password_token", "roof", "sign_in_count", "state", "status", "time_zone", "updated_at", "zipcode") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29, $30, $31, $32) RETURNING "id"
---
    if params["user"]["phone"]
      phone = params["user"]["phone"]
    end
    @user = User.create(:ip => request.remote_ip, :campaign => campaign, :zipcode => zipcode, :name => name, :address => address, :city => city, :state => state, :email => email, :phone => phone, :electric => electric)

UPDATE "users" SET "last_sign_in_at" = '2013-04-27 23:32:16.367638', "current_sign_in_at" = '2013-04-27 23:32:16.367638', "last_sign_in_ip" = '127.0.0.1', "current_sign_in_ip" = '127.0.0.1', "sign_in_count" = 1, "updated_at" = '2013-04-27 23:32:16.369300' WHERE "users"."id" = 108
---
      response = a.post(url, params)
      puts d = Nokogiri::XML(response.content)
      @user.lead = d.xpath("//lead_id").text
      @user.save!