app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def results
    @users = User.all.sort

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "108"]]
UPDATE "users" SET "age" = 'Under 18', "employment" = 'Making less than $1500 per month', "medical" = 'Yes', "attorney" = 'No', "desc" = 'sdfsdf', "updated_at" = '2013-09-12 22:26:01.874980' WHERE "users"."id" = 21
---
  def update
    @user = User.find(params[:id])
    if params["employment"]
      @user.employment = params["employment"]
      @user.save!